app/Controllers/Auth.php

    public function check(){

        //validate user input from login form

        $validation = $this->validate([
            'email' => [
                'rules'     => 'required|valid_email|is_not_unique[users.email]',
                'errors'    => [
                    'required'      => 'Your email is required',
                    'valid_email'   => 'Your must enter valid email address',
                    'is_not_unique'     => 'this email is not register in our system'
                ]
            ],
            'password' => [
                'rules'     => 'required|min_length[5]|max_length[12]',
                'errors'    => [
                    'required'      => 'Password is required',
                    'min_length'    => 'Password must have atleast 5 characters in length',
                    'max_length'    => 'Password must not have characters more than 12 in length'
                ]
            ]
        ]);

        if(!$validation){
            return view('auth/login',['validation'=>$this->validator]);
        }else{
             //check user
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');
            $userModel = New UsersModel();
            $user_info = $userModel->where('email',$email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'g@gmail.com'
 LIMIT 1