app/Controllers/Dashboard.php

    public function index(){
        /*$userModel = New UsersModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '7'