app/Libraries/MyAuth.php

SELECT *
FROM `users`
---
    public function getAllUsers(){

        $users = $this->user->findAll();

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
---
    public function getUserDetails($id){
        $user = $this->user->where('id',$id)->first();

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function isLoggedin(){
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $this->user->find($loggedUserID);